Tekla Open API Reference for Tekla Structures 2025
EnvironmentVariables.Add Method
 Adds a variable to the list.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static void Add(
	string key
)
Public Shared Sub Add (
	key As String
)
Parameters
key
Type: System.String
The variable to be added.
See Also
Reference
EnvironmentVariables Class
Tekla.Structures.Dialog.UIControls Namespace